In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
movies_df = pd.read_csv('/cxldata/skin_disease_1/sudeep/recommended_system/movielen/movies.csv')
ratings_df = pd.read_csv('/cxldata/skin_disease_1/sudeep/recommended_system/movielen/ratings.csv')

In [4]:
movies_df.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [5]:
ratings_df.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [10]:
movies_df = movies_df.drop(columns='genres')

KeyError: "['genres'] not found in axis"

In [11]:
movies_df

      movieId                                      title
0           1                           Toy Story (1995)
1           2                             Jumanji (1995)
2           3                    Grumpier Old Men (1995)
3           4                   Waiting to Exhale (1995)
4           5         Father of the Bride Part II (1995)
...       ...                                        ...
9737   193581  Black Butler: Book of the Atlantic (2017)
9738   193583               No Game No Life: Zero (2017)
9739   193585                               Flint (2017)
9740   193587        Bungo Stray Dogs: Dead Apple (2018)
9741   193609        Andrew Dice Clay: Dice Rules (1991)

[9742 rows x 2 columns]

In [14]:
ratings_df = pd.read_csv('/cxldata/skin_disease_1/sudeep/recommended_system/movielen/ratings.csv')
ratings_df = ratings_df.drop(columns = 'timestamp')

In [15]:
ratings_df

        userId  movieId  rating
0            1        1     4.0
1            1        3     4.0
2            1        6     4.0
3            1       47     5.0
4            1       50     5.0
...        ...      ...     ...
100831     610   166534     4.0
100832     610   168248     5.0
100833     610   168250     5.0
100834     610   168252     5.0
100835     610   170875     3.0

[100836 rows x 3 columns]

In [16]:
movie_merged = movies_df.merge(ratings_df, on='movieId')

In [18]:
movie_merged.head()

   movieId             title  userId  rating
0        1  Toy Story (1995)       1     4.0
1        1  Toy Story (1995)       5     4.0
2        1  Toy Story (1995)       7     4.5
3        1  Toy Story (1995)      15     2.5
4        1  Toy Story (1995)      17     4.5

In [20]:
movie_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100836 entries, 0 to 100835
Data columns (total 4 columns):
movieId    100836 non-null int64
title      100836 non-null object
userId     100836 non-null int64
rating     100836 non-null float64
dtypes: float64(1), int64(2), object(1)
memory usage: 3.8+ MB

In [22]:
movie_merged_group = movie_merged.groupby('title')['rating'].count().reset_index().rename(columns={'rating':'totalratingcount'})[['title','totalratingcount']]

In [25]:
movie_merged_group.sort_values('totalratingcount',ascending=False)

                                          title  totalratingcount
3158                        Forrest Gump (1994)               329
7593           Shawshank Redemption, The (1994)               317
6865                        Pulp Fiction (1994)               307
7680           Silence of the Lambs, The (1991)               279
5512                         Matrix, The (1999)               278
...                                         ...               ...
4773                King Solomon's Mines (1950)                 1
4772                King Solomon's Mines (1937)                 1
4771                          King Ralph (1991)                 1
4769                     King Kong Lives (1986)                 1
9718  À nous la liberté (Freedom for Us) (1931)                 1

[9719 rows x 2 columns]

In [27]:
print(movie_merged_group['totalratingcount'].describe())

count    9719.000000
mean       10.375141
std        22.406220
min         1.000000
25%         1.000000
50%         3.000000
75%         9.000000
max       329.000000
Name: totalratingcount, dtype: float64

In [32]:
combine_movie_rating = movie_merged.dropna(axis = 0, subset = ['title'])

In [33]:
combine_movie_rating

        movieId                                      title  userId  rating
0             1                           Toy Story (1995)       1     4.0
1             1                           Toy Story (1995)       5     4.0
2             1                           Toy Story (1995)       7     4.5
3             1                           Toy Story (1995)      15     2.5
4             1                           Toy Story (1995)      17     4.5
...         ...                                        ...     ...     ...
100831   193581  Black Butler: Book of the Atlantic (2017)     184     4.0
100832   193583               No Game No Life: Zero (2017)     184     3.5
100833   193585                               Flint (2017)     184     3.5
100834   193587        Bungo Stray Dogs: Dead Apple (2018)     184     3.5
100835   193609        Andrew Dice Clay: Dice Rules (1991)     331     4.0

[100836 rows x 4 columns]

In [40]:
movie_merged_group

                                          title  totalratingcount
0                                    '71 (2014)                 1
1       'Hellboy': The Seeds of Creation (2004)                 1
2                        'Round Midnight (1986)                 2
3                           'Salem's Lot (2004)                 1
4                     'Til There Was You (1997)                 2
...                                         ...               ...
9714                            eXistenZ (1999)                22
9715                                 xXx (2002)                24
9716             xXx: State of the Union (2005)                 5
9717                      ¡Three Amigos! (1986)                26
9718  À nous la liberté (Freedom for Us) (1931)                 1

[9719 rows x 2 columns]

In [41]:
movie_merged

        movieId                                      title  userId  rating
0             1                           Toy Story (1995)       1     4.0
1             1                           Toy Story (1995)       5     4.0
2             1                           Toy Story (1995)       7     4.5
3             1                           Toy Story (1995)      15     2.5
4             1                           Toy Story (1995)      17     4.5
...         ...                                        ...     ...     ...
100831   193581  Black Butler: Book of the Atlantic (2017)     184     4.0
100832   193583               No Game No Life: Zero (2017)     184     3.5
100833   193585                               Flint (2017)     184     3.5
100834   193587        Bungo Stray Dogs: Dead Apple (2018)     184     3.5
100835   193609        Andrew Dice Clay: Dice Rules (1991)     331     4.0

[100836 rows x 4 columns]

In [35]:
rating_with_totalRatingCount = combine_movie_rating.merge(movie_merged_group, left_on = 'title', right_on = 'title', how = 'left')
rating_with_totalRatingCount.head()

   movieId             title  userId  rating  totalratingcount
0        1  Toy Story (1995)       1     4.0               215
1        1  Toy Story (1995)       5     4.0               215
2        1  Toy Story (1995)       7     4.5               215
3        1  Toy Story (1995)      15     2.5               215
4        1  Toy Story (1995)      17     4.5               215

In [45]:
rating_with_totalRatingCount.shape

(100836, 5)

In [39]:
movie_merged_group['totalratingcount'].describe()

count    9719.000000
mean       10.375141
std        22.406220
min         1.000000
25%         1.000000
50%         3.000000
75%         9.000000
max       329.000000
Name: totalratingcount, dtype: float64

In [42]:
popularity = 50
movie_merged_popularity = rating_with_totalRatingCount.query('totalratingcount >= @popularity')

In [44]:
movie_merged_popularity.shape

(41362, 5)

In [47]:
movie_merged_df = movie_merged_popularity.pivot_table(columns='userId',index='title',values='rating').fillna(0)

In [48]:
movie_merged_df.head()

userId,1,2,3,4,5,6,7,8,9,10,...,601,602,603,604,605,606,607,608,609,610
title,,,,,,,,,,,,,,,,,,,,,
10 Things I Hate About You (1999),0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,3.0,0.0,5.0,0.0,0.0,0.0,0.0,0.0
12 Angry Men (1957),0.0,0.0,0.0,5.0,0.0,0.0,0.0,0.0,0.0,0.0,...,5.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2001: A Space Odyssey (1968),0.0,0.0,0.0,0.0,0.0,0.0,4.0,0.0,0.0,0.0,...,0.0,0.0,5.0,0.0,0.0,5.0,0.0,3.0,0.0,4.5
28 Days Later (2002),0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,3.5,0.0,5.0
300 (2007),0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,3.0,...,0.0,0.0,0.0,0.0,3.0,0.0,0.0,5.0,0.0,4.0

In [49]:
from scipy.sparse import csr_matrix

movie_merged_df_matrix = csr_matrix(movie_merged_df.values)

In [51]:
movie_merged_df_matrix.shape

(450, 606)

In [52]:
movie_merged_df_matrix

<450x606 sparse matrix of type '<class 'numpy.float64'>'
	with 41360 stored elements in Compressed Sparse Row format>

In [53]:
movie_merged_df.shape

(450, 606)

In [54]:
from sklearn.neighbors import NearestNeighbors

knn = NearestNeighbors(metric='cosine',algorithm='brute')
knn.fit(movie_merged_df)

NearestNeighbors(algorithm='brute', leaf_size=30, metric='cosine',
                 metric_params=None, n_jobs=None, n_neighbors=5, p=2,
                 radius=1.0)

In [55]:
query_index = np.random.choice(movie_merged_df.shape[0])

In [56]:
query_index

310

In [57]:
distances, indices = knn.kneighbors(movie_merged_df.iloc[query_index,:].values.reshape(1, -1), n_neighbors = 6)

In [58]:
for i in range(0, len(distances.flatten())):
    if i == 0:
        print('Recommendations for {0}:\n'.format(movie_merged_df.index[query_index]))
    else:
        print('{0}: {1}, with distance of {2}:'.format(i, movie_merged_df.index[indices.flatten()[i]], distances.flatten()[i]))

Recommendations for Platoon (1986):

1: Apocalypse Now (1979), with distance of 0.44565748051694:
2: Full Metal Jacket (1987), with distance of 0.4516584039351673:
3: Reservoir Dogs (1992), with distance of 0.47921320670667034:
4: Goodfellas (1990), with distance of 0.5101682903985354:
5: Untouchables, The (1987), with distance of 0.5125122031267267:

In [60]:
movie_merged_df.index[310]

'Platoon (1986)'